<script setup></script>
<template>

<div class="page page-center">
      <div class="container container-narrow py-4">
        <div class="text-center mb-4">
          <a href="." class="navbar-brand navbar-brand-autodark">
            <img src="/static/logo.svg" width="110" height="32" alt="xin-ai" class="navbar-brand-image">
          </a>
        </div>
        <div class="card card-md">
          <div class="card-body">
            <h3 class="card-title">服务条款</h3>
            <div class="markdown">
              <p>我们（xin-ai的员工）经营着一个名为的网站托管平台，希望您使用它。xin-ai的基本服务是免费的，我们为高级功能提供付费升级。我们的服务旨在让您对网站上的内容拥有尽可能多的控制权和所有权。但是，要对你发布的内容负责。特别是，确保你的内容中没有任何违禁物品（如垃圾邮件、病毒或严重的暴力威胁）。</p>
              <hr />
              <p>以下条款和条件适用于xin-ai网站的所有使用以及网站上或通过网站提供的所有内容、服务和产品。我们的服务是在您接受的情况下提供的，而不修改此处包含的所有条款和条件以及xin-ai可能不时发布的所有其他操作规则、政策（包括但不限于程序）（统称为“协议”）。您同意我们可以自动升级我们的服务，这些条款将适用于任何升级。</p>
              <p>在访问或使用我们的服务之前，请仔细阅读本协议。通过访问或使用我们的任何部分服务，您同意受本协议条款和条件的约束。如果您不同意本协议的所有条款和条件，则您可能无法访问或使用我们的任何服务。如果这些条款和条件被xin-ai视为要约，则接受明确限于这些条款。</p>
              <p>我们的服务不针对16岁以下的用户，仅向16岁或以上的用户提供访问和使用我们的服务。如果您未满16岁，请不要注册使用我们的服务。任何注册为用户或向我们的服务提供个人信息的人都表示他们年满16岁。使用我们的服务需要一个xin-ai帐户。您同意在注册账户时向我们提供完整准确的信息。您将对使用您的用户名进行的任何活动全权负责。您有责任保护您的密码安全。</p>
              <h3 id="1-xin-aiio">1. xin-ai.zusux.com</h3>
              <ul>
                <li>
                  <p><strong>贡献者的责任。</strong>如果您将材料发布到xin-ai，在xin-ai上发布链接，或以其他方式提供（或允许任何第三方提供）材料（任何此类材料，“内容”），您应对该内容或您的行为的内容以及由此造成的任何伤害负全责。无论内容采用何种形式，都是如此，包括但不限于文本、照片、视频、音频或代码。通过使用xin-ai，您声明并保证您的内容和行为不会违反这些条款。通过将内容提交给xin-ai以包含在您的帐户中，您授予xin-ai一个全球范围的、免版税的、非排他性的许可证，以复制、修改、改编和发布内容，仅用于显示、分发和推广您的变更日志。如果您删除内容，xin-ai将尽合理努力将其从xin-ai中删除，但您承认，对内容的缓存或引用可能不会立即变得不可用。在不限制任何这些声明或保证的情况下，xin-ai有权（但没有义务）自行决定：（i）由于长期不活动而收回您的用户名或网站的URL，（ii）拒绝或删除xin-ai合理认为违反任何xin-ai政策或以任何方式有害或令人反感的任何内容，或（iii）以任何理由终止或拒绝任何个人或实体访问和使用xin-ai。xin-ai没有义务退还之前支付的任何款项。</p>
                </li>
                <li>
                  <p><strong>HTTPS.</strong> 默认情况下，我们在所有xin-ai帐户上提供免费HTTPS</p>
                </li>
              </ul>
              <h3 id="2-responsibility-of-visitors">2. 访客的责任</h3>
              <p>xin-ai没有审查，也不能审查发布到我们服务的所有材料，包括计算机软件，因此不能对该材料的内容、用途或效果负责。通过运营我们的服务，xin-ai并不代表或暗示它认可在那里张贴的材料，或者它认为这些材料是准确、有用或无害的。您有责任采取必要的预防措施，保护自己和计算机系统免受病毒、蠕虫、特洛伊木马和其他有害或破坏性内容的侵害。我们的服务可能包含冒犯性、不雅或其他令人反感的内容，以及包含技术不准确、印刷错误和其他错误的内容。我们的服务还可能包含侵犯第三方隐私权或公开权，或侵犯知识产权和其他专有权的材料，或下载、复制或使用这些材料须遵守附加条款和条件，无论是否声明。xin-ai对访问者使用我们的服务或下载我们发布的内容所造成的任何伤害不承担任何责任。</p>
              <h3 id="3-content-posted-on-other-websites">3. 发布在其他网站上的内容</h3>
              <p>我们没有也无法审查通过xin-ai链接的网站和网页以及xin-ai链接提供的所有材料，包括计算机软件。xin-ai对这些非xin-ai网站没有任何控制权，也不对其内容或使用负责。通过链接到非xin-ai网站，xin-ai并不代表或暗示其认可该网站。您有责任采取必要的预防措施，保护自己和计算机系统免受病毒、蠕虫、特洛伊木马和其他有害或破坏性内容的侵害。xin-ai对您使用非xin-ai网站和网页造成的任何伤害不承担任何责任。</p>
              <h3 id="5-copyright-infringement-and-dmca-policy">5. 版权侵权和DMCA政策</h3>
              <p>协议不会将任何xin-ai或第三方知识产权从xin-ai转让给您，该等知识产权的所有权利、所有权和权益将仅由xin-ai保留（在双方之间）。xin-ai徽标以及与xin-ai或我们的服务相关的所有其他商标、服务标记、图形和徽标均为xin-ai或xin-ai许可方的商标或注册商标。与我们的服务相关的其他商标、服务标志、图形和徽标可能是其他第三方的商标。您使用我们的服务不授予您复制或以其他方式使用任何xin-ai或第三方商标的权利或许可。</p>
              <h3 id="6-intellectual-property">6. 知识产权</h3>
              <p>本协议不会将任何xin-ai或第三方知识产权从xin-ai转让给您，该等知识产权的所有权利、所有权和权益将仅由xin-ai保留（在双方之间）。xin-ai徽标以及与xin-ai或我们的服务相关的所有其他商标、服务标记、图形和徽标均为xin-ai或xin-ai许可方的商标或注册商标。与我们的服务相关的其他商标、服务标志、图形和徽标可能是其他第三方的商标。您使用我们的服务不授予您复制或以其他方式使用任何xin-ai或第三方商标的权利或许可。</p>
              <h3 id="7-changes">7. 更改</h3>
              <p>我们不断更新我们的服务，这意味着有时我们必须更改提供服务的法律条款。如果我们做出重大更改，我们将在更改日志上发布，或在更改生效前向您发送电子邮件或其他通信，让您知道。该通知将指定一段合理的时间，在此之后新条款将生效。</p>
              <h3 id="8-disclaimer-of-warranties">8. 保证免责声明</h3>
              <p>我们的服务是“按原样”提供的。xin-ai及其供应商和许可方特此否认任何形式的明示或暗示保证，包括但不限于适销性、适用于特定目的和不侵权的保证。xin-ai及其供应商和许可方均不保证我们的服务不会出错，或者访问服务将是连续或不间断的。</p>
              <h3 id="9-license">9. 许可证</h3>
              <p>通过使用xin-ai，你承认你已经阅读并同意了，所以请仔细阅读。</p>
              <h3 id="10-general-representation-and-warranty">10. 一般陈述和保证</h3>
              <p>您声明并保证（i）您使用我们的服务将严格遵守xin-ai隐私政策和本协议，以及所有适用的法律和法规（包括但不限于您所在国家、州、市或其他政府区域的任何有关在线行为和可接受内容的地方法律或法规，包括有关传输从美国或您居住的国家输出的技术数据的所有适用法律），以及（ii）您使用我们的服务将不得侵犯或挪用任何第三方的知识产权。</p>
              <h3 id="12-refund-policy">12. 退款政策</h3>
              <p>xin-ai的付款不可因任何原因退还</p>
              <h3 id="13-translation">13. 翻译</h3>
              <p>这些服务条款最初是用中文编写的。我们可以把这些术语翻译成其他语言。如果本服务条款的翻译版本与中文版本发生冲突，以中文版本为准。</p>
            </div>
          </div>
        </div>
      </div>
    </div>
</template>

<style></style>